In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chennai',np.nan]}
dict1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [3]:
d1=pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [4]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [11]:
dict2={'Names':['Aravind','Samar',None,'Siri'],
      'Age':[None,21,32,43],
      'City':['Hyd','Blr','Chennai',None]}
dict2

{'Names': ['Aravind', 'Samar', None, 'Siri'],
 'Age': [None, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', None]}

In [7]:
d2=pd.DataFrame(dict2)
d2

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2     None  32.0  Chennai
3     Siri  43.0     None

In [8]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [9]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [10]:
d2.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

**np.nan**

    - Not a Number - applicable for numerical columns only

    -

**Empty Rows**

- Generally data has some empty rows

- It is a data problem

- If you read that kind of data you will see Null

- You need to understand it is a data corrupted or really a Null values are there

**Method -1**

**Fill with some random value**

**Method name**- Fill NAN  with fillna() method

**Method-2**

- We can fill the values w.r.t. columns

In [13]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [14]:
d1.fillna(40)

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2       40  32.0  Chennai
3     Siri  43.0       40

In [15]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [17]:
d1['Age'].fillna(40)

# it will not updated
#inplace=False

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [18]:
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [20]:
d1['Age'].fillna(40,inplace=True)
d1

# it will not updated
#inplace=True

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [22]:
d1['Names'].fillna('Almannan',inplace=False)

0     Aravind
1       Samar
2    Almannan
3        Siri
Name: Names, dtype: object

In [24]:
d1['Names'].fillna('Almannan',inplace=True)
d1

      Names   Age     City
0   Aravind  40.0      Hyd
1     Samar  21.0      Blr
2  Almannan  32.0  Chennai
3      Siri  43.0      NaN

In [25]:
d1['City'].fillna('Warangal',inplace=True)
d1

      Names   Age      City
0   Aravind  40.0       Hyd
1     Samar  21.0       Blr
2  Almannan  32.0   Chennai
3      Siri  43.0  Warangal

In [26]:
d1.isnull()

   Names    Age   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [28]:
dd1={'Names':['Aravind','Samar',np.nan,'Siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chennai',np.nan]}
dd1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

**Method 3**

- bfill

- ffill
  
- pad

- backfill
-

In [29]:
d1=dd1

In [30]:
d1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [32]:
d1.fillna(method='bfill')
d1

AttributeError: 'dict' object has no attribute 'fillna'

In [35]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chennai',np.nan]}
dict1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [36]:
d1=pd.DataFrame(dict1)

In [37]:
d1.fillna(method='bfill')
d1

C:\Users\Almannan\AppData\Local\Temp\ipykernel_5288\3725287749.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [39]:
d1.fillna(method='bfill')
d1

C:\Users\Almannan\AppData\Local\Temp\ipykernel_5288\3725287749.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [41]:
d1.ffill()

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

In [42]:
d1.pad()

C:\Users\Almannan\AppData\Local\Temp\ipykernel_5288\623536010.py:1: FutureWarning: DataFrame.pad/Series.pad is deprecated. Use DataFrame.ffill/Series.ffill instead
  d1.pad()

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

In [44]:
d1.fillna(method='bfill',axis=1)
d1

C:\Users\Almannan\AppData\Local\Temp\ipykernel_5288\3897386034.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill',axis=1)

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [46]:
d1.bfill(axis=1)

     Names   Age     City
0  Aravind   Hyd      Hyd
1    Samar  21.0      Blr
2     32.0  32.0  Chennai
3     Siri  43.0      NaN

**Axis filling**

axis = 0 - fills with next row values

axis = 1 - fills with next column values

In [47]:
d1.ffill()

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

In [48]:
d1.ffill(axis=1)

     Names      Age     City
0  Aravind  Aravind      Hyd
1    Samar     21.0      Blr
2      NaN     32.0  Chennai
3     Siri     43.0     43.0

**backfill and bfill and ffill**

backfill and bill fill with Next value

pad and ffill fill with previous value

but it will change based on axis

In [49]:
d1.backfill()

C:\Users\Almannan\AppData\Local\Temp\ipykernel_5288\1185957511.py:1: FutureWarning: DataFrame.backfill/Series.backfill is deprecated. Use DataFrame.bfill/Series.bfill instead
  d1.backfill()

     Names   Age     City
0  Aravind  21.0      Hyd
1    Samar  21.0      Blr
2     Siri  32.0  Chennai
3     Siri  43.0      NaN

In [50]:
d1.bfill()

     Names   Age     City
0  Aravind  21.0      Hyd
1    Samar  21.0      Blr
2     Siri  32.0  Chennai
3     Siri  43.0      NaN

In [51]:
d1.pad()

C:\Users\Almannan\AppData\Local\Temp\ipykernel_5288\623536010.py:1: FutureWarning: DataFrame.pad/Series.pad is deprecated. Use DataFrame.ffill/Series.ffill instead
  d1.pad()

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

In [52]:
d1.ffill()

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

**Method 4**

- Mean

    - Numerica values can fill with mean values

    - but mean affected by outliers

    - if we dont hav outliers, it is the best one

- Median

    - Numerical values can fill with median value

    - We know that median values does not affect with outliers

    - so if Outleirs are there, we can go with median
 
- Mode

    -  Mode is used for categorical data
    -  
-

In [53]:
d1=pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

# We already know that we can fill with some vlaues based on specific column

# d1.fillna(<random NUmber>)

In [57]:
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [58]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_median)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [59]:
age_mode=d1['Age'].mode()
d1['Age'].fillna(age_mode)

0    21.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [60]:
names_mode=d1['Names'].mode()
d1['Names'].fillna(names_mode)

0    Aravind
1      Samar
2       Siri
3       Siri
Name: Names, dtype: object

In [61]:
city_mode=d1['Names'].mode()
d1['City'].fillna(city_mode)

0        Hyd
1        Blr
2    Chennai
3        NaN
Name: City, dtype: object

In [62]:
d1['City'].mode()

0        Blr
1    Chennai
2        Hyd
Name: City, dtype: object

In [63]:
Fill with random value

SyntaxError: invalid syntax (4039632909.py, line 1)

**Method - 5**

**KNN imputer**

- KNN : K nearest Neighbors

- K is a hyper parameter means user can choose

- It is a distance metric - Euclidian distance

- KNN imputer will take the mean of the neighbors vlaue

- the neighbors value can provided by using value=k

In [68]:

1      Samar
2       Siri
3       Siri
Name: Names, dtype: object
city_mode=d1['Names'].mode()
d1['City'].fillna(city_mode)
0        Hyd
1        Blr
2    Chennai
3        NaN
Name: City, dtype: object
d1['City'].mode()
0        Blr
1    Chennai
2        Hyd
Name: City, dtype: object






Type Markdown and LaTeX:

SyntaxError: invalid syntax (3534034710.py, line 1)

In [67]:
from sklearn.impute import KNNImputer
KI = KNNImputer()
KI.fit_transform(d1[['Age']])

array([[32.],
       [21.],
       [32.],
       [43.]])